text = f'''<pre>Приветствую вас в KUR VPN! 🚀

В честь того, что вы наш новый пользователь👤
У нас для вас есть 3 дня пробной подписки в подарок!🎁
Чтобы узнать о своих преимуществах, нажмите на кнопку Мой VPN:</pre>
'''
def referal_text(check_user, callback):
    return f'''🔥 Мы дарим VPN за друзей!
    Каждый приглашённый: +5 дней подписки в подарок 💫

    ⚡️ Поделитесь ссылкой →

    👥 Друг регистрируется →

    🎁 Получайте дни бесплатно!

    Приглашено пользователей: {check_user.referal_count}
                                        
    Ваша реферельная ссылка:
    <pre>https://t.me/@botintestin_bot?start={callback.from_user.id}</pre>
                                    
    '''
def time_hendlers(price, time_butt):
    return f'''💎 Подписка VPN на {time_butt} мес.
    💳 К оплате: {price[time_butt]}Р.
    ‼️ Если не загружается страница, выключите VPN и попробуйте снова

    ✅ После оплаты просто вернитесь в Telegram — ваша подписка продлится автоматически'''

photo_path = r'C:\Users\SKM\Documents\Bandicam\photo_2025-12-02_20-31-10.jpg'

def static_user(user, sub, vpn, days_left, shop, shop_money):
    return f'''
📊 Статистика пользователя

🆔 Telegram ID: {user.telegram_id}
📅 Дата регистрации: {user.reg_date}

💳 Подписка:
• Статус: {sub.status}
• Действует до: {vpn.expired_at if sub.status == 'active' else 'истекший'}
• Осталось дней: {days_left if sub.status == 'active' else 'истекший'}
• UUID: {vpn.uuid if vpn.uuid else 'такого пользователя нет'}
• Последнее продление: {shop if shop else 'Продлений не было'}
• Всего заплачено: {shop_money if shop_money else 'Не заплатил'}


🎁 Рефералы:
• Приглашено: {user.referal_count if user.referal_count else 0}
• Бонусов выдано на: {user.referal_count * 5 if user.referal_count else 0} дней.'''