text = f'''<pre>Приветствую вас в KUR VPN! 🚀

В честь того, что вы наш новый пользователь👤
У нас для вас есть 3 дня пробной подписки в подарок!🎁
Чтобы узнать о своих преимуществах, нажми на кнопку ниже:</pre>
'''
def referal_text(check_user, callback):
    return f'''🔥 Мы дарим VPN за друзей!
    Каждый приглашённый: +5 дней подписки в подарок 💫

    ⚡️ Поделитесь ссылкой →

    👥 Друг регистрируется →

    🎁 Получайте дни бесплатно!

    Приглашено пользователей: {check_user.referal_count}
                                        
    Ваша реферельная ссылка:
    <pre>https://t.me/@botintestin_bot?start={callback.from_user.id}</pre>
                                    
    '''
def time_hendlers(price, time_butt):
    return f'''💎 Подписка VPN на {time_butt} мес.
    💳 К оплате: {price[time_butt]}Р.
    ‼️ Если не загружается страница, выключите VPN и попробуйте снова

    ✅ После оплаты просто вернитесь в Telegram — ваша подписка продлится автоматически'''

photo_path = r'C:\Users\SKM\Documents\Bandicam\photo_2025-12-02_20-31-10.jpg'